## 9-4　カテゴリ型の組み合わせ

In [1]:
import numpy as np
import pandas as pd

In [2]:
customer_tb = pd.read_csv('customer.csv')
print(customer_tb.shape)
customer_tb.head()

(1000, 5)

  customer_id  age    sex  home_latitude  home_longitude
0         c_1   41    man      35.092193      136.512347
1         c_2   38    man      35.325076      139.410551
2         c_3   49  woman      35.120543      136.511179
3         c_4   43    man      43.034868      141.240314
4         c_5   31    man      35.102661      136.523797

In [3]:
customer_tb['sex_and_age'] = pd.Categorical(customer_tb[['sex', 'age']].apply(lambda x: '{}_{}'.format(x[0], np.floor(x[1] / 10) *10), axis=1))
customer_tb.head()

  customer_id  age    sex  home_latitude  home_longitude sex_and_age
0         c_1   41    man      35.092193      136.512347    man_40.0
1         c_2   38    man      35.325076      139.410551    man_30.0
2         c_3   49  woman      35.120543      136.511179  woman_40.0
3         c_4   43    man      43.034868      141.240314    man_40.0
4         c_5   31    man      35.102661      136.523797    man_30.0